Revit 2027 API
SpecTypeId.MassPerUnitLength Property
 Mass per Unit Length, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MassPerUnitLength { get; }
Public Shared ReadOnly Property MassPerUnitLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MassPerUnitLength {
	ForgeTypeId^ get ();
}
static member MassPerUnitLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace